[{"stmt":"SELECT * FROM attractions;","header":["id","attraction_key","name","type","thrill_level","height_req","avg_wait","avg_rating","longitude","latitude","created_at","updated_at","url","thumbnail","description"],"rows":[["1","381d26ec-255e-4b0f-b607-85700c558682","Swashbuckler","Flat","Moderate","42","NULL","NULL","-118.597307","34.425962","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/swashbuckler","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Swashbuckler-Web-Banner.jpg","{\"0\": \"Just like the brave pirates next door on the Buccaneer, the Swashbuckler is your ticket to a daring adventure. \\u00a0You\\u2019ll fly boldly through the air with the trees at your feet!\"}"],["2","8750565b-7fa5-4c19-938b-00e21d629d42","Sylvester’s Pounce and Bounce","Kids","Mild","36","NULL","NULL","-118.596031","34.425157","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/sylvesters-pounce-and-bounce","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_sylvesters_pounce_bounce_1440x1533-1.jpg","{\"0\": \"Everyone knows that cats are light on their feet \\u2013 they pounce and bounce all over the place, and now\\u2019s your chance to leap and dive along with your favorite big cat, Sylvester!\", \"1\": \"Take a seat and pounce with silly Sylvester all the way to the top of a 20-foot tall tower. But look out, Tweety\\u2019s waiting up there to konk Sylvester on the head and send the whole gang bouncing down in a wobbly, jiggly, bouncy ride. But never too fast, as this tower drop is for the younger cats. You\\u2019ll jounce and flounce in fits and starts, drop down, then glide back up, then back down\\u2014this silly cat can\\u2019t keep track!\\u00a0 You may not purr but you\\u2019ll definitely have a laugh attack!\"}"],["3","a6fb2d33-2044-4a00-ab01-a7f54c947e12","Taz’s Trucking Co.","Kids","Mild","0","NULL","NULL","-118.596392","34.424782","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/tazs-trucking-co","https://sf-static.sixflags.com/wp-content/uploads/2020/04/default_app-ride-kid_36-1.jpg","{\"0\": \"Young truckers get ready to hit the road at Taz\\u2019s Trucking Company!\\u00a0 Big colorful trucks with giant wheels drive like oversized toys come to life on this pint-sized course. Taz\\u2019s sawmill is the scene, and your job is to haul lumber with your big vehicles. It seems Taz chewed up a lot of wood and needs you to haul it away.\", \"1\": \"The trucks wind through the woodsy setting and covered tunnels.\\u00a0 Even though the trucks are on a slow and gentle track, the youngest truckers will feel like they\\u2019re driving, just like the big kids.\"}"],["4","52b0db32-35f3-4d93-a2eb-1535a87e0b15","THE RIDDLER’s Revenge","Roller Coaster","Maximum","54","NULL","NULL","-118.599867","34.424193","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/riddlers-revenge","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sixflagsbattleselects_148.sized__0.jpg","{\"0\": \"You have to stand up to a villain like THE RIDDLER, and that\\u2019s exactly what this record-setting stand-up roller coaster has in store for you. You\\u2019ll have to take on this scoundrel standing, not sitting down in a chair, while it takes\\u00a0you through the highest, fastest, longest stand-up track in the world. Not only that, but it also has the biggest loop and the most upside-down action for any stand-up coaster.\", \"1\": \"This gigantic green machine will be anything but a walk in the park for even the bravest crime-fighters. We sure hope you like being upside down, because almost immediately you\\u2019ll be facing loop after loop and inversion after inversion on a track that soars 156 feet in the sky. Just to keep you on your toes, you\\u2019ll streak through a pair of corkscrews at 65 miles per hour, on this winding and utterly unpredictable track, while enjoying a whopping 4.2 G\\u2019s.\", \"2\": \"No one will blame you if you need to take a seat after you\\u2019re done facing this relentless coaster. Until then, feel proud \\u2013 you stood up to the wrath of THE RIDDLER!\", \"3\": \"Loose articles are not permitted on this ride. All items (phones, hats, purses, keys, etc.) must left in a locker or with a non-rider.\"}"],["5","928920d6-08dc-4a5c-97ba-b7316aa06001","Tweety’s Escape","Kids","Mild","36","NULL","NULL","-118.596149","34.425844","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/tweetys-escape","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_tweetyescape_1440x1533-1.jpg","{\"0\": \"It seems like Tweety\\u2019s always on the run. And just like Tweety, you can jump into a kid-sized birdcage and swing away, just in case that clever cat Sylvester chases you.\", \"1\": \"On this swinging, circling ride, every rider gets their very own giant birdcage to climb inside. Then each individual cage lifts off the ground and sways in a floaty circle around the centerpiece, featuring murals of Granny, Tweety, and Sylvester tiptoeing around. But that big cat should know that when you\\u2019re in your own personal birdcage there\\u2019s no way he can catch you! Suspended from a golden awning, the little birdcages full of your little birds keep circling until the coast is clear.\"}"],["6","87c55076-dc32-440a-b5d9-be7cc6afcf68","Viper","Roller Coaster","Maximum","54","NULL","NULL","-118.595457","34.421038","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/viper","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_viper2-1-scaled.jpg","{\"0\": \"Since it was built Viper has been one of the tallest and fastest looping roller coasters in the world. Just looking at Viper\\u2019s collection of loops from the ground will boggle the mind, but there\\u2019s only one way to truly appreciate the extreme intensity of a vertical loop, and that\\u2019s to ride it!\", \"1\": \"An enormous structure, made of red and white steel, this metal snake rises to 188 feet and slithers down the track at 70 miles per hour.\\u00a0 The first drop is 171 feet, but you are about to head into a series of insane loops\\u2014seven in all! It\\u2019s nearly non-stop loop action as you zing around in circles one after another. The tallest vertical loop you\\u2019ll face is 14 stories high. Your serpent-like green train whips its tail through the loopy course so fast you\\u2019ll forget which way is down.\", \"2\": \"Coiling track, corkscrews and zig zags connect you to the incredible boomerang (or \\u201cbatwing\\u201d) loop, and by this time you should probably be getting comfortable with flying through the sky, upside down, at top speeds, like a giant snake \\u2026 or maybe not. \\u00a0\"}"],["7","0ec65538-8b4a-4295-8697-21b0f32f6fa5","Canyon Blaster","Roller Coaster","Mild","36","NULL","NULL","-118.596067","34.424905","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/canyon-blaster","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_canyon_blaster_1440x1533-1.jpg","{\"0\": \"The little Road Runners in your group\\u00a0will give ol\\u2019 Wile E. Coyote a run for his money on this curvy, wavy, junior roller coaster that will be absolutely hair-raising for young children.\", \"1\": \"Rustle up your little ones, step into a classic Acme mining car and get ready for a sweet and breezy ride that will remind you of scenes from classic Road Runner cartoons.\", \"2\": \"This will be a short but spirited zing through woodsy trails, suitable for kids over 33\\u201d with a parent and over 36\\u201d riding on their own. \\u00a0The steepest hill is only 8 feet, and the top speed is 10 miles per hour, but you will get some hustle on the twists, turns, and mini-drops, sure to give your junior daredevils breathtaking thrills.\"}"],["8","a8474562-bc2c-42a9-9ab0-e0588fbc9ced","CraZanity","Flat","Maximum","52","NULL","NULL","-118.598683","34.424989","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/crazanity","https://sf-static.sixflags.com/wp-content/uploads/CraZanity_-Banner.jpg","{\"0\": \"At a record-breaking 170 feet in the air, CraZanity reaches speeds up to 75-miles-per-hour, as it swings back and forth\\u2014higher and higher giving riders a staggering view of the world below.\"}"],["9","49dfe200-1143-48da-89e9-bf26973d494e","Daffy’s Adventure Tours","Kids","Mild","0","NULL","NULL","-118.596429","34.424667","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/daffys-adventure-tours","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_daffys_adventure_tours_1440x1533-1-e1616095894660-1295x720.jpg","{\"0\": \"All aboard the tour bus for a wacky ride made just for your smallest ducklings to enjoy.\\u00a0 But when your tour guide is that crazy duck, you know you\\u2019re in for the ride of your life.\", \"1\": \"Even the littlest tykes will love a seat on Daffy\\u2019s magical tour bus, which leaves the ground and gently floats low in the air as it circles its scenic route of colorful trees surrounding snow covered mountains, and a view of Bugs Bunny World!\\u00a0 That crazy Daffy sometimes even drives the bus backwards.\\u00a0 But the wide bench seats and nice slow pace make this the comfiest, safest, easiest tour in town.\"}"],["10","96bedfae-8c9a-4718-adb9-3230f9f2a1bb","Elmer’s Weather Balloons","Kids","Mild","0","NULL","NULL","-118.596179","34.425264","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/elmers-weather-balloons","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Elmers-Weather-Balloons-Banner.jpg","{\"0\": \"Silly wabbit, it\\u2019s time to lift off in a hot air balloon with your host Elmer Fudd!\\u00a0 Climb into one of Elmer\\u2019s colorful striped balloon baskets and get ready to lift into the air.\", \"1\": \"Now you\\u2019re cruisin\\u2019, as your personal hot air balloon circles, floating up and around.\\u00a0 You can simply look over the edge of your basket to enjoy a view of the Looney Tunes neighborhood on your mellow flight, or your little daredevils can grab hold of the center disk and give it a spin it to make the balloon spin wildly around.\\u00a0 Try it and you\\u2019ll finally know what they mean by \\u201cdizzying heights.\\u201d\\u00a0 As Elmer would say, it\\u2019s \\u201cvewy, vewy\\u201d fun!\"}"],["11","067001fe-6ccd-4c78-a086-2dd0c5326aec","Jammin’ Bumpers","Flat","Mild","42","NULL","NULL","-118.599133","34.424298","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/jammin-bumpers","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Jammin-Bumpers-Banner.jpg","{\"0\": \"Anyone feel like a nice relaxed drive in the country?\\u00a0 Not this summer\\u2014instead get ready to rev up for a round of classic bumper cars!\\u00a0 Let your inner asphalt addict out for a rambunctious round of rubber road rage!\", \"1\": \"Step onto the shiny metal race course and choose your ride.\\u00a0 Once you pick your color, jump in, and with one click of a seatbelt you\\u2019re ready to rumble.\\u00a0 Grab the wheel, slam your foot on the accelerator, and the smash-up is on.\", \"2\": \"Careening through the crowded track, swerve fast to miss a collision or you\\u2019ll bang right into your neighbor\\u2019s cars.\\u00a0 Luckily those big rubber bumpers let you bounce off and keep right on driving\\u2014smack into the next fender bender!\", \"3\": \"Speed up or slow down, it\\u2019s up to you, just watch out because\\u2014bam!\\u00a0 This crash course is the most fun you\\u2019ll ever have in traffic.\"}"],["12","9e59b9e6-8610-4a36-8cc6-5df48b4dbc6b","Whistlestop Train","Transportation","Mild","0","NULL","NULL","-118.596599","34.426057","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/whistlestop-train","https://sf-static.sixflags.com/wp-content/uploads/sfne_neexpress_1440x1533_1.jpg","{\"0\": \"Woo-woo! The trains are pulling into the station at this kid-sized train-themed playground with its own trainlines, depot, and gift shop. It\\u2019s a whole world of trains that will dazzle choo-choo lovers of all ages.\", \"1\": \"You can ride the Whistlestop Train on its brightly colored engine, pulling out of the station for a magical ride through Whistlestop Park. Or take the Magic Flyer Roller Coaster, whose big green engine will take the tykes on a sweet open-air junior train coaster ride up a 10 foot tall hill! There\\u2019s a lot to keep you busy in this charming little train village. Whether you\\u2019re taking a breather from the action or your little ones just love locomotives, Whistlestop Park is a great destination to visit.\"}"],["13","0aaa6dd1-8e47-4e89-a8aa-4183a4d58eb9","WONDER WOMAN™ Flight of Courage","Roller Coaster","Maximum","48","NULL","NULL","-118.5974","34.4259","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/wonder-woman-flight-of-courage","https://sf-static.sixflags.com/wp-content/uploads/SFMM-WWFOC-1500x675-1-1440x675.png","{\"0\": \"Six Flags Magic Mountain\\u2019s record 20th coaster\\u2014the most at any theme park in the world\\u2014WONDER WOMAN\\u2122 Flight of Courage is NOW OPEN\\u00a0as the tallest and longest single-rail coaster on the planet. Riders will fly single file through the sky over 3,300 feet of track, towering 13 stories and soaring at speeds up to 58 miles-per-hour.\\u00a0\", \"1\": \"WONDER WOMAN\\u2122 Flight of Courage is located in the six-acre DC UNIVERSE\\u2122 area of the park, which has been entirely remodeled to include a new, entry portal immersing guests into the DC inspired land. Plus retail locations featuring exclusive DC branded merchandise.\", \"2\": \"DC UNIVERSE\\u2122 is also home to\\u00a0the popular BATMAN\\u2122\\u00a0The Ride\\u00a0and the newly themed\\u00a0TEEN TITANS\\u2122 Turbo Spin.\\u00a0\", \"3\": \"WONDER WOMAN\\u2122 Flight of Courage exemplifies the Super Hero\\u2019s traits of strength and speed\\u2014showcasing the legacy of WONDER WOMAN\\u2122 herself. As guests enter the ride queue, influenced by Greek architecture and featuring tropical landscaping, they will be immersed in the story of her life and how she obtained her super powers.\", \"4\": \"Riders will join forces with WONDER WOMAN\\u2122 in the fight for truth, justice, and equality, to embark on an incredible journey of heroic feats, propelling through dives, banks, rolls, and turns designed to challenge the bravest of thrill seekers.\", \"5\": \"WONDER WOMAN and all related characters and elements \\u00a9 & \\u2122 DC Comics.\", \"6\": \"WONDER WOMAN and all related characters and elements \\u00a9 & \\u2122 DC Comics.\\u00a0\"}"],["14","50abfc9e-99a8-4fd6-83f4-32d22b0d861e","TEEN TITANS™ Turbo Spin","Flat","Moderate","48","NULL","NULL","-118.5974","34.4259","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/teen-titans-turbo-spin","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Teen-Titans-Turbo-Spin.png","{\"0\": \"The TEEN TITANS are the prot\\u00e9g\\u00e9s of the World\\u2019s Greatest Superheroes, but with potential that big, the expectations are even greater. Join forces with them as they unite to fight their enemies, spanning galaxies, dimensions and beyond.\\u00a0 Do you think you can take it?\", \"1\": \"Take your place atop a giant circular disk and get ready to spin.\\u00a0 As the big wheel under your feet turns, hold onto the wall behind you.\\u00a0 Pretty soon the whole world starts to rotate around you, so fast you can\\u2019t even move.\\u00a0 The spinning force will push you to your limit!\", \"2\": \"You\\u2019ll be pinned to the side by sheer gravity, like in a giant centrifuge.\\u00a0 This must be how it feels to when TEEN TITANS unite!\", \"3\": \"As the wheel tilts on its axis to 45 degrees, you\\u2019ll be spinning wildly out of control, but count on the most powerful adolescents to magically hold you in place.\"}"],["15","29767806-af6f-4c97-b7f3-5459e6fa1a97","Apocalypse","Roller Coaster","Moderate","48","NULL","NULL","-118.599748","34.421425","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/apocalypse","https://sf-static.sixflags.com/wp-content/uploads/Apocalypse-Banner-2-1.jpg","{\"0\": \"Head into the bunker and get ready to launch into the front line of battle on this blazingly fast drive into sci-fi combat. Future war has turned the world into a bleak, burned out wasteland and you are living the aftermath. Apocalypse is the all-wooden roller coaster that rips through this ominous desert on an ultra-fast\\u00a0track. You\\u2019ve gotta ride like the wind to escape.\", \"1\": \"You made it past the security checkpoint and high tech monitors explaining your assignment. Now pile into the industrial cars and get ready to dodge explosive wrecks and maneuver some of the most insane drops and swift turns the future will ever produce through 2,850ft./868.68m of track that is all wood and all muscle.\", \"2\": \"You won\\u2019t believe how fast this wooden brute runs as it takes a series of daredevil pivots and shoots through mist-filled tunnels \\u2014just in time for more total mayhem on the track. But hey, it\\u2019s all in a day\\u2019s work for a soldier from the future.\", \"3\": \"\", \"4\": \"Single Rider Line available on select days.\", \"5\": \"\"}"],["16","2d591137-9aaf-47f8-9c30-ac7f062f2896","BATMAN The Ride","Roller Coaster","Maximum","54","NULL","NULL","-118.600086","34.426041","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/batman-ride","https://sf-static.sixflags.com/wp-content/uploads/Batman-Banner.jpg","{\"0\": \"BATMAN The Ride will show you what it feels like to be BATMAN, on this deeply intense juggernaut that is definitely not for the timid. Show your strength and bravery as you take on GOTHAM\\u2019s criminal element. Once you\\u2019ve gotten your fill touring the shady, decaying backstreets of GOTHAM CITY, load up in the batcave for a dark and riveting adventure. You\\u2019re about to fight crime with your feet just dangling free in the air through 2,700ft./822.96m of track.\", \"1\": \"Following a 105-foot lift to the top of the world to fly with the bats, brace yourself for a full 360-degree loop right from the start. You\\u2019re a global superhero, you don\\u2019t need to warm up. After escaping that obstacle, there\\u2019s a fully inverted roll, then a second loop waiting for you about ten seconds later. Next you\\u2019ll be pounded by a double set of wingovers and corkscrew descents with enough G-force to plaster you to your seat. How do a whopping 4 G\\u2019s sound? Because that\\u2019s what you\\u2019ll be taking right about now.\", \"2\": \"Watch the ground under your feet whip around as the city below inverts over and over, through a tightly packed series of gravity-defying twists that will grind you into submission just like the criminals of GOTHAM CITY.\", \"3\": \"Loose articles of any kind are not permitted on this ride and must be left in a locker or with a non-rider.\\u00a0\"}"],["17","abb949f2-0209-4ea1-a58d-380f342d9210","Speedy Gonzales Hot Rod Racers","Roller Coaster","Moderate","36","NULL","NULL","-118.596494","34.425291","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/speedy-gonzales-hot-rod-racers","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Speedy-Gonzales-Hot-Rod-Racers-Web-Banner.jpg","{\"0\": \"Speedy Gonzales Hot Rod Racers are part of Bugs Bunny World and is\\u00a0our fourth roller coaster \\u2014 more than any other U.S. theme park!\", \"1\": \"Kids and parents will hop aboard the miniature hot rod race cars together and enjoy an action-packed ride. You\\u2019ll experience plenty of drops and thrills as you sprint around the grand prix track.\", \"2\": \"This mini-coaster is the perfect training ground for future thrill seekers. One day they\\u2019ll ride Tatsu, Goliath and Full Throttle but in the meantime, here\\u2019s a fun and friendly smaller-scale roller coaster for the little ones in your crew.\"}"],["18","c3a68205-f339-4dc9-94ec-a70f84a0e919","SUPERMAN: Escape from Krypton","Roller Coaster","Maximum","48","NULL","NULL","-118.598162","34.423777","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/superman-escape-krypton","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Superman-Escape-Krypton-Web-Banner.jpg","{\"0\": \"Tunnel deep into SUPERMAN\\u2019s icy Fortress of Solitude to face the ultimate challenge\\u20141,315 feet of track that bends straight up into the sky\\u00a0415 feet high!\", \"1\": \"SUPERMAN\\u2019s home world of Krypton is beautiful but daring.\\u00a0 Watch out for the walls lined with glowing green kryptonite! You and 13 other would-be super heroes must escape by piling into a sleek car that will blast you off this frozen rock.\", \"2\": \"Strap in, take a deep breath, and get ready to blast off. You\\u2019re about to shoot from 0 to 100 miles per hour in seven seconds flat\\u2014in reverse. This record-breaking speed and acceleration has never before been achieved in a thrill ride, let alone backwards. And now you know how this ride got its name\\u2014this is the greatest escape of all time!\", \"3\": \"You\\u2019ll blast off like SUPERMAN, launching straight up the track at 90 degrees, a full 415 feet in the air! Hold on tight because once you\\u2019re totally vertical you\\u2019ll experience utter weightlessness for 6.5 seconds. But don\\u2019t get too used to it, because what goes up must come down. You\\u2019ll pretty much instantly plummet back down the tower track at a slamming 92 miles per hour, faster than a speeding bullet. This type of insane acceleration is only possible with a cutting edge electromagnetic motor designed just for SUPERMAN: Escape from Krypton.\", \"4\": \"The world races by as you fly face first right back down the track to Earth. Now all you need is a cape.\"}"],["19","7b2d1041-5354-418a-bd1a-dd35ad6e0536","Tatsu","Roller Coaster","Maximum","54","NULL","NULL","-118.597424","34.421522","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/tatsu","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Tatsu-Banner-2.jpg","{\"0\": \"Sitting proudly at the top of Samurai Summit, you\\u2019ll see a fierce beast made of bright orange, and green steel.\\u00a0 This is no ordinary coaster\\u2026this is a dragon.\", \"1\": \"Tatsu is a flying roller coaster with an utterly unique way to ride\\u2014face down.\\u00a0 This mad twist puts you in a one-on-one stare-down with planet Earth, as you fly at speeds up to 62 miles per hour. The structure itself is 170 feet tall, but when combined with the height of the mountain it\\u2019s sitting on, you\\u2019re in for a 263-foot elevation change over the course of the journey.\", \"2\": \"You will truly feel like a dragon in flight as you face the gauntlet\\u20143,602 feet of steel track twisted into scream-inducing heights and dips. By the time you reach the top of the first hill, you might have some idea of what you\\u2019re in for. Face down, with the track behind you, there is nothing between you and the ground! You won\\u2019t even be able to see the track at all, just the dirt and sky racing past you in a dizzying blur.\", \"3\": \"You\\u2019ll corkscrew down 104 feet, zooming around the track at top speeds and right into 96 feet of zero G roll. If you don\\u2019t feel like you\\u2019re flying yet, just add an 80-foot tall horseshoe. Then get ready to roll because the 124-foot tall pretzel loop with your name on it is simply unreal. As if that wasn\\u2019t enough, you\\u2019ll whip around a 77-foot-tall in-line twist, completing your soaring journey over the park, before Tatsu is done with you and ready to breathe fire on the next batch of dragon slayers.\", \"4\": \"Single Rider Line available on select days.\\u00a0\", \"5\": \"Loose articles of any kind are not permitted on this ride and must be left in a locker or with a non-rider.\"}"],["20","caa9058f-b273-4fda-ab21-28bc03d0466d","The New Revolution – Classic","Roller Coaster","Maximum","48","NULL","NULL","-118.596249","34.421876","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/new-revolution-classic","https://sf-static.sixflags.com/wp-content/uploads/2020/04/the_new_revolution_-_virtual_reality_coaster_2_1-1-scaled.jpg","{\"0\": \"Opening on May 8, 1976, it was originally named the Great American Revolution in honor of the country\\u2019s bicentennial celebration. This white steel track coaster is built into the park\\u2019s lush hillsides and features a fast and furious series of steep, daring dips and dives inspired by those experienced on old-fashioned wooden coasters.\", \"1\": \"In 2016 to commemorate the 40th anniversary, The New Revolution was reopened with newly designed trains, special ride effects, and a new look. \\u00a0The beloved steel roller coaster that has thrilled over 45 million guests in its 40-year reign at the park, has been repainted a brilliant white and blue color, while the newly designed trains have been fitted with lap and calf bars, and features Americana red, white and blue colors with a silver eagle hood adornment. \\u00a0For coaster fans, the elimination of shoulder harnesses provide a smoother, sleeker ride experience with more airtime.\", \"2\": \"Over the years, Revolution has had many cameo appearances in popular television shows and movies, most famously in the 1983 classic National Lampoon\\u2019s Vacation.\"}"],["21","c0310696-bb07-4c5c-9f40-82b06ebd76ed","Buccaneer","Flat","Mild","0","NULL","NULL","-118.597245","34.425942","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/buccaneer","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Buccanner-Banner-Updated.jpg","{\"0\": \"Arrr matey! Climb aboard the sturdy and swift pirate ship Buccaneer and take a rip-roaring voyage. Don\\u2019t be fooled by the calm skies, because once you take your seat on the deck of this pirate ship, you\\u2019ll set sail to the breathtaking height of 67.9 ft. in the air.\", \"1\": \"As the boat starts to rock swiftly up and back, it feels like the Buccaneer is getting tossed around on the surf. You\\u2019ll swing higher and higher into the air until the whole vessel is practically vertical, like you\\u2019re being pushed around by some serious untamed waves. Hold onto your hats and get ready for sheer weightlessness as you hang in the air for a moment, before coming back down and swinging up the next wild wave with stomach-tightening momentum\\u2014in reverse! You\\u2019ll feel the wind race by as you soar even higher. Remember, brave pirates aren\\u2019t supposed to scream! This unstoppable velocity would make even the toughest sailor consider walking the plank. But if you\\u2019re brave enough, a life of adventure awaits!\"}"],["22","1b99e316-0285-4669-9670-86f15ff5e46e","Dive Devil","Flat","Moderate","48","NULL","NULL","-118.599992","34.422896","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/dive-devil","https://sf-static.sixflags.com/wp-content/uploads/SFMM_DIve-Devil-Banner.jpg","{\"0\": \"Get ready to experience the thrill of skydiving, hang-gliding and bungee jumping all rolled into one!\\u00a0 First you\\u2019ll have to get to the top of a 152-foot tower before taking a flying leap from the top with nothing but sky to catch your fall!\", \"1\": \"Strap into the harness with a friend or two and wave goodbye to the ground.\\u00a0 You\\u2019ll stare straight down as you are hoisted up by a slim cable, until you\\u2019re so high you\\u2019ll only hear the wind as you dangle 15 stories in the air. There\\u2019s no turning back now\\u2014the only way to get down is to fall.\\u00a0 In a split second you are released and plummeting back towards the earth in a state of total free fall.\\u00a0 You can plan on hurtling toward the ground as fast as 60 mph.\", \"2\": \"But as soon as the steel cable catches your fall, the momentum of the drop will swing you powerfully forward.\\u00a0 And now you\\u2019re completely airborne, soaring through the atmosphere as the ripcord swings you above the park!\\u00a0 This is a once-in-a-lifetime thrill normally reserved for hang gliders and birds.\", \"3\": \"Additional fee required.\"}"],["23","355a929f-eadd-4a97-9b68-27150d2e358e","Full Throttle","Roller Coaster","Maximum","54","NULL","NULL","-118.596404","34.423862","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/full-throttle","https://sf-static.sixflags.com/wp-content/uploads/2020/04/mn_FullThrottle_LA.jpg","{\"0\": \"Here it is, the latest in a long history of world records set at Six Flags Magic Mountain:\\u00a0 Full Throttle. The number one tallest and fastest looping roller coaster in the world.\\u00a0 You are riding the best of the best and it can\\u2019t be topped.\", \"1\": \"You\\u2019ll be looping 160 feet in the sky\\u2014a feat no one else in the world has done until now. No one else has even dared to try it. And, it\\u2019s just not enough to do a loop of this magnitude once, so you\\u2019re taking it on twice.\", \"2\": \"Full Throttle has not just one but three separate launches. That means from a complete stop you\\u2019ll crank up to 70 miles hour like it was nothing. The second time you launch at this rapid speed, only it\\u2019ll be backwards.\\u00a0 That\\u2019s right, you\\u2019ll come to a slamming stop inside a sci-fi tunnel, only to be bolted back out, in reverse! Looping just as high, just as fast, only backwards.\", \"3\": \"Halfway up the dive loop, the train changes its mind \\u2013 let\\u2019s go forward\\u2014and you switch directions mid-loop. Back into the tunnel you go, shooting toward the next act, when you\\u2019ll hit that mega-loop again as a \\u201ctop hat\\u201d \\u2013 riding on the outside of the world-record track\\u2014something that has never been done before.\", \"4\": \"Sailing on top of the world, you\\u2019ll experience incredible hangtime, not to mention the view of the century, before Full Throttle brings your world-record-holding body back down to earth.\"}"],["24","5635ec24-3007-4c28-a0f2-3e97086d0db0","West Coast Racers","Roller Coaster","Maximum","54","NULL","NULL","-118.599878","34.422181","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/west-coast-racers","https://sf-static.sixflags.com/wp-content/uploads/2020/04/wcr-newsletter_1_0-1-scaled.jpg","{\"0\": \"ALL NEW THRILLS! Get ready for West Coast Racers, the world\\u2019s first single track quadruple launch racing coaster!\\u00a0 Unlike traditional coasters, this first of it\\u2019s kind racing coaster features two side-by-side tracks with four individual high-speed launches.\\u00a0 The race covers two complete laps, multiple airtime hills, extreme high-banked turns and exhilarating over/under near misses.\\u00a0 A highlight of the ride is an immersive real time \\u201cpit stop\\u201d designed and produced by world famous West Coast Customs that will provide you with a racing experience unlike any other.\", \"1\": \"Ride features include:\", \"2\": \"West Coast Racers is located in the all new area, The Underground, an LA centric urban-themed area where guests enjoy a high-energy street vibe.\\u00a0 Currently located in this area is the popular wooden coaster, Apocalypse, and Pacific Speedway Go Karts.\"}"],["25","9c2dd888-9673-49ab-bc95-4c7025d0c248","Twisted Colossus","Roller Coaster","Maximum","48","NULL","NULL","-118.598255","34.427381","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/twisted-colossus","https://sf-static.sixflags.com/wp-content/uploads/2020/04/twisted-colossus-1_2.jpg","{\"0\": \"Wood meets steel as the iconic \\u201cwoodie\\u201d returns as the new Twisted Colossus \\u2014 the longest, most innovative hybrid coaster in the world. Still in its landmark location along the perimeter of Six Flags Magic Mountain and nestled inside the tracks of the behemoth coaster, Goliath, Twisted Colossus remains the coaster monument most recognizable to millions of people who pass by the park each year\\u2026but now with an exciting twist.\", \"1\": \"Integrated into the beautiful crosshatching of white wood will be intertwined track, steep banks and unrelenting rolls and spirals. Revel in the fun and excitement of traditional wooden coaster thrills while facing your fears on the latest state-of-the-art coaster technology. Twisted Colossus is the best of both worlds, a modern marvel making\\u00a0roller coaster history!\", \"2\": \"Single Rider: Coming Soon\", \"3\": \"Loose articles of any kind are not permitted on this attraction. All items (phones, hats, glasses, etc.) must be left in a locker or with a non-rider. Filming of any kind is strictly prohibited.\\u00a0\"}"],["26","b3256214-96b2-4d4f-9cf6-ad82fec451c7","Scream","Roller Coaster","Moderate","54","NULL","NULL","-118.598216","34.428026","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/scream","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Scream-Banner.jpg","{\"0\": \"Ever wonder what it feels like to fly through the air, without a plane, a jetpack, or even a pair of wings to hold you up? Well, get ready to get airborne. Scream features a totally one-of-a-kind floorless train design.\\u00a0 Look straight down and all you\\u2019ll see is the ground or the sky, depending on which direction you\\u2019re facing. Since there\\u2019s no track over your head or under your feet, riding Scream is exactly what it feels like to fly.\", \"1\": \"You\\u2019ll be completely upside down seven times. Combine that with the incredible amount of airtime you\\u2019ll feel on the many steep crests and you\\u2019ll really start to get the hang of this flying thing. The first drop is a breathtaking 141-footer. Chase that with a 128-foot vertical loop, immediately followed by a 96-foot loop with a rolling twist. Sorry, no time to take a breath, because then you\\u2019re blasted right into a cobra roll 78 feet in the sky.\", \"2\": \"Fly low to the ground then zoom up at 63 miles per hour for a double corkscrew. Completely open to the wind, with your feet flying through the air below you and nothing over your head, more than any roller coaster you\\u2019ve ever ridden, Scream will show you what it feels like to soar through 4,000ft./1,219.2m of track.\", \"3\": \"\\u00a0\", \"4\": \"Loose articles are not permitted on this ride. All items (phones, hats, purses, keys, etc.) must left in a locker or with a non-rider.\"}"],["27","c2eedda9-7ab6-4b01-90e9-a51f3932f77f","Roaring Rapids","Water","Moderate","42","NULL","NULL","-118.597205","34.421454","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/roaring-rapids","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Roaring-Rapids-Banner.jpg","{\"0\": \"Gear up for the ultimate white-water river rafting experience, on the very first man-made rapids built in the Western U.S.\\u00a0 You and your team of 11 riders will launch into the wettest wilderness adventure west of the Rockies.\", \"1\": \"You\\u2019ll strap into your full-scale round river raft and set loose into the raging downstream flow, where wildly unpredictable currents will toss you around without warning, and treacherous falls will send you shooting over the edge.\", \"2\": \"You are swung wildly around rocks and into swirling whirlpools, blasted with water from all directions.\\u00a0 Swooshing down the river at 10 miles per hour you will definitely get splashed, and if you are unlucky \\u2013 or lucky, depending on how hot it is that day\\u2014you might even get completely drenched.\\u00a0 White water waves come crashing over the raft as your boat spins and dips down the wild river. Don\\u2019t plan on staying dry!\"}"],["28","70bea10a-2801-4328-9227-d44a53cf1fc9","Road Runner Express","Roller Coaster","Mild","36","NULL","NULL","-118.596059","34.425848","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/road-runner-express","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Road-Runner-Express-Banner.jpg","{\"0\": \"Beep beep!\\u00a0 Here\\u2019s a fun and friendly smaller-scale roller coaster for the little road runners in your crew.\\u00a0 Are your little birds ready to take on their first big-kid thrill ride?\\u00a0\\u00a0 Road Runner Express may be small, but it packs a big punch, delivering lots of oohs and aahs for the mild adventurists in your family.\", \"1\": \"Jump on the train for a light-hearted, breezy ride through the rambling trails of the desert.\\u00a0 You\\u2019ll outrun Wile E. Coyote on a bendy, curvy track that swerves through the rocks and cactus, leaving that crafty coyote in the dust!\", \"2\": \"Your Acme train will chug through this whirlwind 679-foot/206.9-meter track in just under a minute. From a peak height of 28 feet, your junior drop isn\\u2019t too steep, but is still exciting enough for a little tummy-tickle. Just like a quick little road runner, you\\u2019ll take a 21 mph ride through swift curves and switchbacks that will be extra jaw-dropping for all the little cuckoos in your roost.\"}"],["29","382c54b7-06b4-4c0d-b281-14840affc54c","Pepe LePew’s Tea Party","Kids","Mild","42","NULL","NULL","-118.596161","34.425056","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/pepe-lepews-tea-party","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Pepe-Le-Pews-Tea-Party-Banner.jpg","{\"0\": \"It was love at first sight when skunky Pepe Le Pew first saw his lady\\u2014too bad she was a cat!\\u00a0 But that didn\\u2019t stop smelly Pepe, he\\u2019s just too romantic to quit.\\u00a0 Now your little gang of skunks can feel just as woozy as Pepe does chasing his true love, on this spinning set of mini-teacups.\", \"1\": \"Choose a seat from this brightly colored tea party set, then spin around Pepe\\u2019s giant love potion perfume, like a skunk in love. Grab on to the center disk and give it a whirl to make your teacup spin a little faster, or spin it harder to make your teacup revolve at top speed. You control the pace of your spins! Feeling a little dizzy?\\u00a0 Now you know how Pepe Le Pew feels when he thinks about that special cat. This wacky ride is suitable for skunks and cats of all sizes!\"}"],["30","699f8c13-aec9-4985-a2bd-2cb22e52edc7","Magic Flyer","Roller Coaster","Mild","0","NULL","NULL","-118.596471","34.425956","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/magic-flyer","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Magic-Flyer-Banner.jpg","{\"0\": \"Children can enjoy gentle hills and pint sized thrills on this junior-sized open-air roller coaster. Young thrill seekers will ride up a 10 foot tall hill and see the sights in the charming little train village of Whistlestop Park.\"}"],["31","23e361c9-751a-4652-8aa6-24efaed5f1ff","Lex Luthor: Drop of Doom","Flat","Maximum","48","NULL","NULL","-118.598533","34.426313","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/lex-luthor-drop-doom","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Lex-Luthor-Drop-of-Doom-Banner.jpg","{\"0\": \"LEX LUTHOR\\u2019s corporation LexCorp is certainly up to no good.\\u00a0 LEX is bent on world domination, and he\\u2019s starting by destroying your sanity on this thrilling\\u00a0descent. This is the tallest and fastest drop tower on the planet \\u2013 the ultimate free fall!\", \"1\": \"Strap into your chair and settle in, because the ride to the top of the 415ft./126.5m tower will be the longest 90 seconds of your life. You\\u2019ll be hoisted up more than 40 stories in the air as the people below you grow further and further away. When you look down, all you\\u2019ll see are your feet dangling in the air and the sheer drop of 400 feet straight beneath you.\", \"2\": \"LEX shares the same tower with his arch-enemy SUPERMAN: Escape from Krypton, and if you\\u2019re lucky, or unlucky depending on how you look at it, you might catch the SUPERMAN cars riding right next to you.\", \"3\": \"Once you hit the top, you\\u2019ll get some friendly advice from the mastermind of this ride, LEX LUTHOR, but you might be too busy shaking in your boots to hear a word he says. Suddenly, without warning, it\\u2019s time to free fall, as you release and plummet straight down to the earth at a staggering 85 adrenaline-charged miles per hour, so fast you\\u2019ll barely have time to scream.\", \"4\": \"On the way out check out the LexCorp weapons training facility \\u2013 fun and carnival-style games to win prizes, and the Daily Planet gift shop so you can prove to your friends at home you had the nerve to take the steepest drop in Southern California.\"}"],["32","6910bf9e-6699-4f4f-932f-4487477dcea3","JUSTICE LEAGUE: Battle for Metropolis","Dark","Mild","48","NULL","NULL","-118.599607","34.423993","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/justice-league-battle-metropolis-3","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Justice-League-Banner-2-1440x720.jpg","{\"0\": \"Join members of the JUSTICE LEAGUE\\u2122 Reserve Team in a multi-sensory four-minute game experience facing wind, fire, fog and special effects as you battle alongside iconic DC Super Heroes, BATMAN, SUPERMAN, WONDER WOMAN, THE FLASH, CYBORG and GREEN LANTERN\\u00a0to save the city of METROPOLIS\\u2122 from LEX LUTHOR, THE JOKER and his henchmen. \\u00a0Also wreaking havoc is HARLEY QUINN, THE JOKER\\u2019s\\u00a0favorite sidekick.\", \"1\": \"Prepare to be immersed in climatic battle scenes between the DC Super Heroes and Super-Villains including a multitude of special effects and thrilling ride experiences as you shoot targets and score points against your friends and family while traveling on a high-speed chase through the streets of METROPOLIS!\", \"2\": \"JUSTICE LEAGUE\\u2122: Battle for Metropolis features:\"}"],["33","94939158-989a-460b-a3d2-669123cff17f","Yosemite Sam’s Flight School","Kids","Mild","42","NULL","NULL","-118.596261","34.425106","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/yosemite-sams-flight-school","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_yosemitesamsflightschool_la_1440x1533-1.jpg","{\"0\": \"It\\u2019s never too early to learn how to fly. That ornery cowboy Yosemite Sam is your host as you fly away in your very own youngster-sized airplane! Pick out your favorite color propeller plane and get ready to take off into the air, flying round and round and up and down, just like a real airplane! You can hear those propellers whirr as the engines start and you soar up into the air. You can stay low to the ground, or pull back on the steering wheel\\u00a0\\u2014\\u00a0you decide how high you want to fly! When you come down for a landing, you\\u2019re sure to want to fly again. For your little pilot\\u2019s first flight, let Yosemite Sam show you how it\\u2019s done.\"}"],["34","7ac167da-22ac-45f9-b0c7-4836dd7d8573","X2","Roller Coaster","Maximum","48","NULL","NULL","-118.595561","34.421602","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/x2-coaster","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_x2_1440x1533-1.jpg","{\"0\": \"Get ready to enter an all-new realm on X2, a trail-blazing fifth dimension roller coaster. With its 360-degree rotating seats and head-first, face down drops, X has been one of the most popular\\u00a0thrill rides on the planet. On ordinary roller coasters, the train stays in line with the track\\u2026 but there is nothing ordinary about X2.\", \"1\": \"Go ahead and take in the view on the long ride up, 200 feet in the air. \\u00a0Enjoy the groundbreaking use of music, sound effects, and fire that have been carefully designed to heighten your total sensory overload. X2\\u2019s utterly innovative design will keep your mind in full thrust the entire time.\", \"2\": \"Your 360-degree seats extend on wings far off the track.\\u00a0 So while you are careening down the rails at 76 miles per hour through an unreal assortment of dives, flips and twists, as well as two ultra-rare \\u201craven turns\\u201d \\u2014 half loops that change their minds midway and become sheer drops\\u2014your body will also be flipping around 360-degrees over and over again. Quite simply, you will be spun into another dimension.\", \"3\": \"Loose articles are not permitted on this ride. All items (phones, hats, purses, keys, etc.) must left in a locker or with a non-rider.\\u00a0\"}"],["35","a84c26e8-ae61-485a-b4d4-0df8e226ca8f","Scrambler","Flat","Mild","36","NULL","NULL","-118.599074","34.424155","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/scrambler","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Scrambler-Banner.jpg","{\"0\": \"Ever wondered what it feels like to be a scrambled egg?\\u00a0 Well, spin fiends rejoice, because today you just might find out.\\u00a0 First the Scrambler will spin you round and round, and then it\\u2019ll put a spin on the spin!\", \"1\": \"The Scrambler is designed to whirl you to dizzying heights.\\u00a0 Take a look around as you pile into one of the 2-person cars clustered like flower petals around the center.\\u00a0 Once we give the whole contraption a twist, your vision will start to scramble!\\u00a0 You\\u2019re circling around the middle while the other riders circle around you\\u2014you\\u2019ll get wobbly just thinking about it.\", \"2\": \"Centrifugal force is a funny thing\\u2014the faster the spin, the harder you\\u2019ll be pressed to the sides of the car.\\u00a0 So in other words, prepare to be smooshed!\\u00a0 You\\u2019ll feel like you\\u2019ve been thrown in a blender\\u2014mixed up, swirled around, and scrambled by the Scrambler!\"}"],["36","5e6ae811-7f2c-438a-8c11-c288652b5094","Pacific Speedway","Flat","Moderate","40","NULL","NULL","-118.600077","34.422737","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/pacific-speedway","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfot_six_flags_speedway_go_karts_1440x1533_0_1_0-1.jpg","{\"0\": \"There\\u2019s nothing like the joy of driving on the open road.\\u00a0 Pacific Speedway\\u00a0brings classic go-kart style racing to a full-size, super-fast speedway.\\u00a0 You can drive your own go-kart if you\\u2019re over 58\\u201d, and you can even choose a two-seater with room for a side-kick.\\u00a0 Though be advised, most tough little racers like to be called \\u201cco-pilots.\\u201d\", \"1\": \"Rev your engine at the starting line, then slam your pedal to the metal and blast off for a road race that\\u2019ll make your little ones feel like they\\u2019re in the Indy 500.\\u00a0 Even not-so-little ones will get a major kick out of zooming around the track in these mega-cool turbo-buggies.\", \"2\": \"The pavement course carves through the hills, with hairpin turns sure to make the engines growl as the wind whooshes by.\\u00a0 Don\\u2019t forget to wave to your fans as you cross the finish line.\\u00a0 Champions do that sort of thing.\", \"3\": \"Additional fee required.\"}"],["37","9f7ac828-7d40-46b7-849b-841549db35c9","Ninja","Roller Coaster","Moderate","42","NULL","NULL","-118.598271","34.421974","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/ninja","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Ninja-Banner-2.jpg","{\"0\": \"There\\u2019s a reason Ninja is known as \\u201cThe Black Belt of Roller Coasters.\\u201d This thrill is a suspended swinging roller coaster. There are only four of this kind in the entire U.S. and you\\u2019re about to ride one of them. You\\u2019re hanging from the track, which on this insane ride is above your head. Shoulder harnesses secure you in place but don\\u2019t expect to just sit in one place \\u2014 you\\u2019re going to be swinging all over, a full 90 degrees each way along 2,700ft./822.9m of track above you.\", \"1\": \"Loose articles of any kind are not permitted on this ride and must be left in a locker or with a non-rider.\\u00a0\", \"2\": \"\"}"],["38","b9562f0c-257c-41a2-a677-86cb8ef7ebb5","Merrie Melodies Carousel","Kids","Mild","0","NULL","NULL","-118.59639","34.42521","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/merrie-melodies-carousel","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Merrie-Melodies-Carousel-Banner-1440x720.jpg","{\"0\": \"Bugs Bunny World has its very own carousel, a mini country fairground replica even the smallest cowboys and cowgirls will love to ride.\\u00a0 Saddle up on the friendly horse of your choice \\u2013 you can almost hear them neigh as they gently bob up and down in time to the music.\", \"1\": \"Round and round you go, on a calmly-paced ride scaled down for little hands and feet.\\u00a0 Tykes get to have fun while they train for the day when they can take on the big rides, but this carousel is also very relaxing for their chaperones.\\u00a0\"}"],["39","8344e098-2092-44cb-a1eb-fedf93ded988","Jet Stream","Water","Moderate","0","NULL","NULL","-118.599246","34.422934","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/jet-stream","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Jet-Stream-Banner-2.jpg","{\"0\": \"Summer days can be hot, and the coolest way to get around town is on a flume!\\u00a0 Jet Stream is a modern water coaster that glides on a river instead of a track.\\u00a0 Get ready to hydro-zoom on a classic Southern California water rush.\", \"1\": \"Jump into one of the brightly-colored boats for your cruise down a wondrous, winding water course in this classic, family-friendly flume ride.\\u00a0 There you are gliding along the river\\u2026 all is peaceful and scenic, until suddenly you are whisked over the edge of an unpredictable waterfall, plunging down a splashy drop!\", \"2\": \"Ahh, you survived that one, but don\\u2019t get too comfortable on the smooth coast down the river, with the wind and water racing past.\\u00a0 Once you make it to the end, a six story nosedive is waiting for you!\\u00a0 Swoop down like a jet over the falls and land with a big splash and a wet conclusion.\"}"],["40","efb22a90-010e-4cb4-b200-15b98122d902","Grand American Carousel","Kids","Mild","0","NULL","NULL","-118.596064","34.42258","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/grand-american-carousel","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Grand-Carousel-Banner.jpg","{\"0\": \"Giddy up! For generations, the carousel has been one of the most magical and cherished rides for young and old alike. The Grand American Carousel carries on that very special tradition with 64 beautiful lovingly hand-carved horses. Choose your favorite and climb onto this charming slow-moving circular ride.\\u00a0 Some horses gently rise up and down, while others stand still for a more stable ride. All are lit up by old fashioned carnival lights and music that transports you to another time.\", \"1\": \"This carousel was originally built in 1912 and is celebrating its 100th birthday! Share the magic and be a part of history on this beautifully restored attraction. It\\u2019s a must-ride ride for couples falling in love, a child\\u2019s first amusement park, or simply friends galloping around with laughs and good times. A ride for the whole family.\"}"],["41","5ac04909-2d8a-48ff-af4d-cc928467d800","Goliath","Roller Coaster","Maximum","48","NULL","NULL","-118.597128","34.426402","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/goliath","https://sf-static.sixflags.com/wp-content/uploads/SFMM_Goliath-Banner.jpg","{\"0\": \"Sometimes the term \\u201croller coaster\\u201d just doesn\\u2019t cover it.\\u00a0 Goliath is so fast they call this metal monster a \\u201chypercoaster,\\u201d and within seconds you\\u2019ll know why. Hike in through the stony ruins of an ancient civilization \\u2013 a time when great mythical beasts like the Goliath were feared. You may not find it so mythical as you\\u2019re getting dragged up that impossibly tall first hill, lifting you higher and higher. About halfway up this ridiculous height, even the toughest riders realize there\\u2019s no way out except to battle the beast. When you crest the top of that first hill, wave to the legendary Twisted Colossus \\u2013 way down below you.\", \"1\": \"And now onto serious business \\u2013 a staggering 255 foot drop which you\\u2019ll take at 85 mph, making this one of the longest and fastest drops in the world. But wait a second, isn\\u2019t this ride only 235 feet tall? That\\u2019s right, the first drop takes you down below the dirt into a dark underground tunnel! Goliath then serves up another quick drop of 185 feet.\", \"2\": \"As you shoot up and over the next hill, enjoy a moment of pure weightlessness, taking some serious airtime before gravity yanks you down into your chair. Prepare to repeat this experience several more times as a series of drops and rises wreak havoc with your sense of gravity along 4,500ft./1,371.6m of track.\", \"3\": \"Speaking of gravity, brace yourself for the unbelievable second half of this journey into steel madness. It\\u2019s pure twister territory, twisting sideways, hugging the ground, and then diving into a helix you\\u2019ll take in excess of 4.5 G\\u2019s. When you pull back into the station, this can\\u2019t-miss speed monster will have basically contorted your cheeks into a huge perma-grin. Don\\u2019t worry, it\\u2019ll wear off the next time you face Goliath.\", \"4\": \"Loose articles are not permitted on this ride. All items (phones, hats, purses, keys, etc.) must left in a locker or with a non-rider.\", \"5\": \"\"}"],["42","0b85d8b2-75f6-49d5-a3c9-6aaef1ab13cb","Gold Rusher","Roller Coaster","Moderate","48","NULL","NULL","-118.598949","34.42348","2023-06-07 20:19:55","NULL","https://www.sixflags.com/magicmountain/attractions/gold-rusher","https://sf-static.sixflags.com/wp-content/uploads/2020/04/sfmm_gold_rusher_1440x1533-1.jpg","{\"0\": \"Travel back to the days of the California gold rush, when brave prospectors traveled deep into the mountains looking for those elusive golden nuggets. You\\u2019ll dive into an old mining car for this crazy ride through the treacherous hills of the frontier. Gold Rusher was the very first roller coaster at Six Flags Magic Mountain, and this rip roarin\\u2019 ride is as fun today as it was the day it opened.\", \"1\": \"The first lift cranks you up 70 feet in the air, and then plummets you down a classic California course 2,590ft./789.4m straight through the wilderness. Head deep into the mines towards unexplored territory as your runaway mine car bolts down a fast and smooth flow of snaking turns.\", \"2\": \"Then this classic ride hugs the hills like a pro. You\\u2019ll feel like you\\u2019re going right along the ground and straight through as you open a flow of slopes and falls. It all builds to a classic 540-degree spiral corkscrew drop that\\u2019ll leave you breathless, yet thirsty for more.\\u00a0 Just like life on the frontier.\", \"3\": \"This attraction is presented by Snickers\\u00ae.\"}"]]}]